      * registro de MOVIMIENTOS.TXT
       01  REG-MOVIMIENTO.
           05  RM-FECHA-MOVIMIENTO   PIC 9(08).
           05  RM-NUMERO-MOVIMIENTO  PIC 9(10).
           05  RM-CODIGO-SUCURSAL    PIC X(04).
           05  RM-CODIGO-TIPO-MOV    PIC X(03).
           05  RM-REFERENCIA         PIC X(20).
           05  RM-VALOR              PIC 9(09)V99.
