      * registro de ASIENTOS.DAT
       01  REG-ASI-DAT.
           05  DAT-FECHA-CONTABLE     PIC 9(08).
           05  DAT-NUMERO-MOVIMIENTO  PIC 9(10).
           05  DAT-CUENTA-CONTABLE    PIC 9(10).
           05  DAT-TIPO-AFECTACION    PIC X(01).
           05  DAT-VALOR              PIC 9(09)V99.
           05  DAT-REFERENCIA         PIC X(20).
