       IDENTIFICATION DIVISION.

       PROGRAM-ID. TSQL001A.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      * SOURCE-COMPUTER. IBM WITH DEBUGGING MODE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT MOV-FILE ASSIGN TO './data/MOVIMIENTOS.TXT'
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS FS-MOV.
           SELECT ASI-FILE ASSIGN TO './data/ASIENTOS.DAT'
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS FS-ASI.
           SELECT REP-FILE ASSIGN TO './data/REPORTE.TXT'
                  ORGANIZATION IS LINE SEQUENTIAL
                  FILE STATUS IS FS-REP.
       DATA DIVISION.
       FILE SECTION.
       FD MOV-FILE.
GIXSQL*    EXEC SQL INCLUDE CPY-CB-MOV END-EXEC.
           COPY CPY-CB-MOV.

       FD ASI-FILE.
GIXSQL*    EXEC SQL INCLUDE CPY-CB-ASI END-EXEC.
           COPY CPY-CB-ASI.

       FD REP-FILE.
GIXSQL*    EXEC SQL INCLUDE CPY-CB-REP END-EXEC.
           COPY CPY-CB-REP.


       WORKING-STORAGE SECTION.

GIXSQL*    EXEC SQL INCLUDE CPY-CB-WS END-EXEC.
           COPY CPY-CB-WS.
GIXSQL*    EXEC SQL INCLUDE CPY-CB-HV END-EXEC.
           COPY CPY-CB-HV.
GIXSQL*    EXEC SQL INCLUDE CPY-CB-CX END-EXEC.
           COPY CPY-CB-CX.

GIXSQL*    EXEC SQL INCLUDE SQLCA END-EXEC.
           COPY SQLCA.


GIXSQL 01  SQ0001.
GIXSQL     02  FILLER PIC X(0056) VALUE "SELECT ESTADO FROM SUCURSALES"
GIXSQL  &  " WHERE CODIGO_SUCURSAL = $1".
GIXSQL     02  FILLER PIC X(1) VALUE X"00".
GIXSQL 01  SQ0002.
GIXSQL     02  FILLER PIC X(0095) VALUE "SELECT CUENTA_DEBITO , CUENTA"
GIXSQL  &  "_CREDITO , ESTADO FROM TIPOS_MOVIMIENTO WHERE CODIGO_TIPO_M"
GIXSQL  &  "OV = $1".
GIXSQL     02  FILLER PIC X(1) VALUE X"00".
GIXSQL 01  SQ0003.
GIXSQL     02  FILLER PIC X(0058) VALUE "SELECT ESTADO FROM PLAN_CUENT"
GIXSQL  &  "AS WHERE CUENTA_CONTABLE = $1".
GIXSQL     02  FILLER PIC X(1) VALUE X"00".
GIXSQL 01  SQ0004.
GIXSQL     02  FILLER PIC X(0058) VALUE "SELECT ESTADO FROM PLAN_CUENT"
GIXSQL  &  "AS WHERE CUENTA_CONTABLE = $1".
GIXSQL     02  FILLER PIC X(1) VALUE X"00".
GIXSQL 01  SQ0005.
GIXSQL     02  FILLER PIC X(0180) VALUE "INSERT INTO MOVIMIENTOS (FECH"
GIXSQL  &  "A_MOVIMIENTO , NUMERO_MOVIMIENTO , CODIGO_SUCURSAL , CODIGO"
GIXSQL  &  "_TIPO_MOV , REFERENCIA , VALOR , FECHA_CONTABLE) VALUES ( $"
GIXSQL  &  "1 , $2 , $3 , $4 , $5 , $6 , $7 )".
GIXSQL     02  FILLER PIC X(1) VALUE X"00".
GIXSQL 01  SQ0006.
GIXSQL     02  FILLER PIC X(0163) VALUE "INSERT INTO ASIENTOS_CONTABLE"
GIXSQL  &  "S (FECHA_CONTABLE , NUMERO_MOVIMIENTO , CUENTA_CONTABLE , T"
GIXSQL  &  "IPO_AFECTACION , VALOR , REFERENCIA) VALUES ( $1 , $2 , $3 "
GIXSQL  &  ", $4 , $5 , $6 )".
GIXSQL     02  FILLER PIC X(1) VALUE X"00".
GIXSQL*   ESQL CURSOR INIT FLAGS (START)
GIXSQL*   ESQL CURSOR INIT FLAGS (END)
       PROCEDURE DIVISION.
GIXSQL*    EXEC SQL WHENEVER SQLERROR CONTINUE END-EXEC.
GIXSQL*    EXEC SQL WHENEVER NOT FOUND CONTINUE END-EXEC.

       100-MAIN.
           PERFORM 000-CONNECT.
           PERFORM 5000-CARGAR-ARCHIVOS.
           DISPLAY 'INGRESE FECHA CONTABLE (AAAAMMDD): '
                   WITH NO ADVANCING.
           ACCEPT IN-FECHA-CONTABLE.
           DISPLAY 'FECHA CONTABLE: ' IN-FECHA-CONTABLE.
           PERFORM 5200-PROCESAR-DATOS.
           PERFORM 5100-CERRAR-ARCHIVOS.
           PERFORM 6000-GENERAR-REPORTE.
           DISPLAY 'LEIDOS ......... ' WS-LEIDOS.
           DISPLAY 'CONTABILIZADOS . ' WS-CONTABILIZADOS.
           DISPLAY 'RECHAZADOS ..... ' WS-RECHAZADOS.
           PERFORM 100-EXIT.


       000-CONNECT.
           ACCEPT DATASRC FROM ENVIRONMENT 'DB1SRC'.
           ACCEPT DBUSR FROM ENVIRONMENT 'DB1USER'.
           ACCEPT DBPWD FROM ENVIRONMENT 'DB1PASS'.
GIXSQL*    EXEC SQL
GIXSQL*    CONNECT TO :DATASRC USER :DBUSR USING :DBPWD
GIXSQL*    END-EXEC.
GIXSQL     CALL STATIC "GIXSQLConnect" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE DATASRC
GIXSQL         BY VALUE 64
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE DBUSR
GIXSQL         BY VALUE 64
GIXSQL         BY REFERENCE DBPWD
GIXSQL         BY VALUE 64
GIXSQL     END-CALL.
           IF SQLCODE <> 0
              DISPLAY 'ERROR DE CONEXION. SQLCODE=' SQLCODE
              GO TO 100-EXIT
           END-IF.


       5000-CARGAR-ARCHIVOS.
           OPEN INPUT MOV-FILE.
           IF FS-MOV <> '00'
              DISPLAY 'ERROR, CARGA DE MOVIMIENTOS.TXT FS=' FS-MOV
              GO TO 100-EXIT
           END-IF.
           OPEN OUTPUT ASI-FILE.
           IF FS-ASI <> '00'
              DISPLAY 'ERROR, CREACION DE ASIENTOS.DAT FS=' FS-ASI
              GO TO 100-EXIT
           END-IF.

       5100-CERRAR-ARCHIVOS.
           CLOSE MOV-FILE.
           IF FS-MOV NOT = '00'
              DISPLAY 'ERROR AL CERRAR MOVIMIENTOS.TXT ' FS-MOV
           END-IF.
           CLOSE ASI-FILE.
           IF FS-ASI NOT = '00'
              DISPLAY 'ERROR AL CERRAR ASIENTOS.DAT ' FS-ASI
           END-IF.

       5200-PROCESAR-DATOS.
           PERFORM UNTIL FIN-ARCHIVO
              READ MOV-FILE
                 AT END
                    SET FIN-ARCHIVO TO TRUE
                 NOT AT END
                    ADD 1 TO WS-LEIDOS
                    SET MOV-VALIDO TO TRUE
                    PERFORM 5210-VALIDAR-MOVIMIENTOS
                    IF MOV-VALIDO
                       PERFORM 5220-GENERAR-ASIENTOS
                       ADD 1 TO WS-CONTABILIZADOS
GIXSQL*                    EXEC SQL COMMIT END-EXEC
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExec" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE "COMMIT" & x"00"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL
                    ELSE
                       ADD 1 TO WS-RECHAZADOS
                    END-IF
              END-READ
           END-PERFORM.

      
       5210-VALIDAR-MOVIMIENTOS.

      *    VALIDAR FECHA CONTABLE
           IF IN-FECHA-CONTABLE NOT = 0
              IF RM-FECHA-MOVIMIENTO NOT = IN-FECHA-CONTABLE
                 SET MOV-RECHAZADO TO TRUE
                 DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                         ' FECHA NO CORRESPONDE'
              END-IF
           END-IF.

      *    VALIDAR VALOR
           IF MOV-VALIDO
              IF RM-VALOR <= 0
                 SET MOV-RECHAZADO TO TRUE
                 ADD 1 TO WS-RECH-VALOR
                 DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                         ' VALOR INVALIDO'
              END-IF
           END-IF.

      *    VALIDAR SUCURSAL Y ESTADO
           IF MOV-VALIDO
              MOVE SPACES TO HV-ESTADO
GIXSQL*                      EXEC SQL
GIXSQL*                      SELECT ESTADO INTO :HV-ESTADO
GIXSQL*                      FROM SUCURSALES
GIXSQL*                      WHERE CODIGO_SUCURSAL = :RM-CODIGO-SUCURSAL
GIXSQL*                      END-EXEC
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetResultParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ESTADO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 4
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-CODIGO-SUCURSAL
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExecSelectIntoOne" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE SQ0001
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 1
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL
              IF SQLCODE NOT = 0
                 SET MOV-RECHAZADO TO TRUE
                 ADD 1 TO WS-RECH-SUC-INEX
                 DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                         ' SUCURSAL INEXISTENTE'
              ELSE
                 IF HV-ESTADO NOT = 'A'
                    SET MOV-RECHAZADO TO TRUE
                    ADD 1 TO WS-RECH-SUC-INAC
                    DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                            ' SUCURSAL INACTIVA'
                 END-IF
              END-IF
           END-IF.

      *    VALIDAR TIPO MOVIMIENTO Y OBTENER CUENTAS
           IF MOV-VALIDO
              MOVE SPACES TO HV-ESTADO
GIXSQL*                      EXEC SQL
GIXSQL*                     SELECT CUENTA_DEBITO, CUENTA_CREDITO, ESTADO
GIXSQL*           INTO :HV-CUENTA-DEBITO, :HV-CUENTA-CREDITO, :HV-ESTADO
GIXSQL*                      FROM TIPOS_MOVIMIENTO
GIXSQL*                      WHERE CODIGO_TIPO_MOV = :RM-CODIGO-TIPO-MOV
GIXSQL*                      END-EXEC
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetResultParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 10
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-CUENTA-DEBITO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetResultParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 10
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-CUENTA-CREDITO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetResultParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ESTADO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 3
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-CODIGO-TIPO-MOV
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExecSelectIntoOne" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE SQ0002
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 3
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL
              IF SQLCODE NOT = 0 OR HV-ESTADO NOT = 'A'
                 SET MOV-RECHAZADO TO TRUE
                 ADD 1 TO WS-RECH-TIPO-MOV
                 DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                         ' TIPO MOVIMIENTO INVALIDO'
              END-IF
           END-IF.

      *    VALIDAR CUENTA DEBITO
           IF MOV-VALIDO
              MOVE SPACES TO HV-ESTADO
GIXSQL*                      EXEC SQL
GIXSQL*                      SELECT ESTADO INTO :HV-ESTADO
GIXSQL*                      FROM PLAN_CUENTAS
GIXSQL*                      WHERE CUENTA_CONTABLE = :HV-CUENTA-DEBITO
GIXSQL*                      END-EXEC
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetResultParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ESTADO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 10
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-CUENTA-DEBITO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExecSelectIntoOne" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE SQ0003
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 1
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL
              IF SQLCODE NOT = 0 OR HV-ESTADO NOT = 'A'
                 SET MOV-RECHAZADO TO TRUE
                 ADD 1 TO WS-RECH-CTA-INAC
                 DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                         ' CUENTA DEBITO INVALIDA'
              END-IF
           END-IF.

      *    VALIDAR CUENTA CREDITO
           IF MOV-VALIDO
              MOVE SPACES TO HV-ESTADO
GIXSQL*                      EXEC SQL
GIXSQL*                      SELECT ESTADO INTO :HV-ESTADO
GIXSQL*                      FROM PLAN_CUENTAS
GIXSQL*                      WHERE CUENTA_CONTABLE = :HV-CUENTA-CREDITO
GIXSQL*                      END-EXEC
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetResultParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ESTADO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 10
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-CUENTA-CREDITO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExecSelectIntoOne" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE SQ0004
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 1
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL
              IF SQLCODE NOT = 0 OR HV-ESTADO NOT = 'A'
                 SET MOV-RECHAZADO TO TRUE
                 ADD 1 TO WS-RECH-CTA-INAC
                 DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                         ' CUENTA CREDITO INVALIDA'
              END-IF
           END-IF.

      *    GRABAR MOVIMIENTO EN BASE DE DATOS
           IF MOV-VALIDO
GIXSQL*       EXEC SQL
GIXSQL*       INSERT INTO MOVIMIENTOS
GIXSQL*       (FECHA_MOVIMIENTO, NUMERO_MOVIMIENTO,
GIXSQL*       CODIGO_SUCURSAL, CODIGO_TIPO_MOV,
GIXSQL*       REFERENCIA, VALOR, FECHA_CONTABLE)
GIXSQL*       VALUES
GIXSQL*       (:RM-FECHA-MOVIMIENTO, :RM-NUMERO-MOVIMIENTO,
GIXSQL*       :RM-CODIGO-SUCURSAL, :RM-CODIGO-TIPO-MOV,
GIXSQL*       :RM-REFERENCIA, :RM-VALOR, :IN-FECHA-CONTABLE)
GIXSQL*       END-EXEC
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 8
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-FECHA-MOVIMIENTO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 10
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-NUMERO-MOVIMIENTO
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 4
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-CODIGO-SUCURSAL
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 3
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-CODIGO-TIPO-MOV
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 20
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-REFERENCIA
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 11
GIXSQL         BY VALUE -2
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE RM-VALOR
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 8
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE IN-FECHA-CONTABLE
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExecParams" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE SQ0005
GIXSQL         BY VALUE 7
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL
              IF SQLCODE NOT = 0
                 SET MOV-RECHAZADO TO TRUE
                 DISPLAY 'RECHAZO ' RM-NUMERO-MOVIMIENTO
                         ' ERROR GRABANDO MOVIMIENTO SQLCODE=' SQLCODE
              END-IF
           END-IF.

     
       5220-GENERAR-ASIENTOS.
           PERFORM VARYING IDX-M FROM 1 BY 1 UNTIL IDX-M > 2
              MOVE IN-FECHA-CONTABLE    TO HV-ASI-FECHA
              MOVE RM-NUMERO-MOVIMIENTO TO HV-ASI-NUMMOV
              MOVE RM-VALOR             TO HV-ASI-VALOR
              MOVE RM-REFERENCIA        TO HV-ASI-REF
              EVALUATE IDX-M
              WHEN 1
                 MOVE HV-CUENTA-DEBITO  TO HV-ASI-CUENTA
                 MOVE 'D'               TO HV-ASI-TIPOAFEC
                 ADD RM-VALOR           TO WS-TOT-DEBITO
              WHEN 2
                 MOVE HV-CUENTA-CREDITO TO HV-ASI-CUENTA
                 MOVE 'C'               TO HV-ASI-TIPOAFEC
                 ADD RM-VALOR           TO WS-TOT-CREDITO
              END-EVALUATE

GIXSQL*       EXEC SQL
GIXSQL*       INSERT INTO ASIENTOS_CONTABLES
GIXSQL*       (FECHA_CONTABLE, NUMERO_MOVIMIENTO,
GIXSQL*       CUENTA_CONTABLE, TIPO_AFECTACION,
GIXSQL*       VALOR, REFERENCIA)
GIXSQL*       VALUES
GIXSQL*       (:HV-ASI-FECHA, :HV-ASI-NUMMOV,
GIXSQL*       :HV-ASI-CUENTA, :HV-ASI-TIPOAFEC,
GIXSQL*       :HV-ASI-VALOR, :HV-ASI-REF)
GIXSQL*       END-EXEC
GIXSQL     CALL STATIC "GIXSQLStartSQL"
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 8
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ASI-FECHA
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 10
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ASI-NUMMOV
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 10
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ASI-CUENTA
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ASI-TIPOAFEC
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 1
GIXSQL         BY VALUE 11
GIXSQL         BY VALUE -2
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ASI-VALOR
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLSetSQLParams" USING
GIXSQL         BY VALUE 16
GIXSQL         BY VALUE 20
GIXSQL         BY VALUE 0
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE HV-ASI-REF
GIXSQL         BY REFERENCE 0
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLExecParams" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL         BY REFERENCE SQ0006
GIXSQL         BY VALUE 6
GIXSQL     END-CALL
GIXSQL     CALL STATIC "GIXSQLEndSQL"
GIXSQL     END-CALL
              IF SQLCODE NOT = 0
                 DISPLAY 'ERROR INSERT ASIENTO SQLCODE=' SQLCODE
                         ' MOV=' RM-NUMERO-MOVIMIENTO
              ELSE
                 MOVE HV-ASI-FECHA    TO DAT-FECHA-CONTABLE
                 MOVE HV-ASI-NUMMOV   TO DAT-NUMERO-MOVIMIENTO
                 MOVE HV-ASI-CUENTA   TO DAT-CUENTA-CONTABLE
                 MOVE HV-ASI-TIPOAFEC TO DAT-TIPO-AFECTACION
                 MOVE HV-ASI-VALOR    TO DAT-VALOR
                 MOVE HV-ASI-REF      TO DAT-REFERENCIA
                 WRITE REG-ASI-DAT
                 IF FS-ASI NOT = '00'
                    DISPLAY 'ERROR ESCRITURA ASIENTO FS=' FS-ASI
                 END-IF
              END-IF
           END-PERFORM.


      * genera el archivo de reporte
       6000-GENERAR-REPORTE.
           OPEN OUTPUT REP-FILE.

           MOVE IN-FECHA-CONTABLE TO WS-LF-VAL.
           WRITE REP-REG FROM WS-LIN-FEC.
           MOVE SPACES TO REP-REG.
           WRITE REP-REG.

           MOVE 'TOTAL REGISTROS LEIDOS'           TO WS-LN-TXT.
           MOVE WS-LEIDOS                          TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE 'TOTAL MOVIMIENTOS CONTABILIZADOS' TO WS-LN-TXT.
           MOVE WS-CONTABILIZADOS                  TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE 'TOTAL MOVIMIENTOS RECHAZADOS'     TO WS-LN-TXT.
           MOVE WS-RECHAZADOS                      TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE SPACES TO REP-REG.
           WRITE REP-REG.

           MOVE 'RECHAZADOS POR SUCURSAL INEXISTENTE' TO WS-LN-TXT.
           MOVE WS-RECH-SUC-INEX                      TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE 'RECHAZADOS POR SUCURSAL INACTIVA'  TO WS-LN-TXT.
           MOVE WS-RECH-SUC-INAC                    TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE 'RECHAZADOS POR TIPO MOVIMIENTO'    TO WS-LN-TXT.
           MOVE WS-RECH-TIPO-MOV                    TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE 'RECHAZADOS POR CUENTA INACTIVA'    TO WS-LN-TXT.
           MOVE WS-RECH-CTA-INAC                    TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE 'RECHAZADOS POR VALOR INVALIDO'     TO WS-LN-TXT.
           MOVE WS-RECH-VALOR                       TO WS-LN-VAL.
           WRITE REP-REG FROM WS-LIN-NUM.

           MOVE SPACES TO REP-REG.
           WRITE REP-REG.

           MOVE 'TOTAL DEBITOS GENERADOS'           TO WS-LM-TXT.
           MOVE WS-TOT-DEBITO                       TO WS-LM-VAL.
           WRITE REP-REG FROM WS-LIN-MON.

           MOVE 'TOTAL CREDITOS GENERADOS'          TO WS-LM-TXT.
           MOVE WS-TOT-CREDITO                      TO WS-LM-VAL.
           WRITE REP-REG FROM WS-LIN-MON.

           MOVE SPACES TO REP-REG.
           WRITE REP-REG.

           IF WS-TOT-DEBITO = WS-TOT-CREDITO
              MOVE 'CUADRE CONTABLE : CORRECTO'  TO REP-REG
           ELSE
              MOVE 'CUADRE CONTABLE : DESCUADRE' TO REP-REG
           END-IF.
           WRITE REP-REG.

           CLOSE REP-FILE.
           DISPLAY 'REPORTE GENERADO EN ./data/REPORTE.TXT'.


       100-EXIT.
GIXSQL*    EXEC SQL CONNECT RESET END-EXEC.
GIXSQL     CALL STATIC "GIXSQLConnectReset" USING
GIXSQL         BY REFERENCE SQLCA
GIXSQL         BY REFERENCE x"00"
GIXSQL         BY VALUE 0
GIXSQL     END-CALL.
           STOP RUN.
GIXSQL*
GIXSQL*   ESQL CURSOR DECLARATIONS (START)
GIXSQL     GO TO GIX-SKIP-CRSR-INIT.
GIXSQL GIX-SKIP-CRSR-INIT.
GIXSQL*
GIXSQL*   ESQL CURSOR DECLARATIONS (END)
