       IDENTIFICATION DIVISION.

       PROGRAM-ID. TSQL001A.


       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.
      * SOURCE-COMPUTER. IBM WITH DEBUGGING MODE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.

       DATA DIVISION.

       FILE SECTION.

       WORKING-STORAGE SECTION.

       01 DATASRC PIC X(64).
       01 DBUSR  PIC X(64).
       01 DBPWD  PIC X(64).

       01 IN-FECHA-CONTABLE PIC 9(8).

      * CONCEPTOS COBRO WS Y TB
           EXEC SQL INCLUDE CPY-CB-CCO END-EXEC.

           EXEC SQL
              INCLUDE SQLCA
           END-EXEC.

       PROCEDURE DIVISION.

       100-MAIN.
           PERFORM 000-CONNECT.
           *> ENVIAR REFERENCIA Y CARGAR CONCEPTOS
           CALL 'CARGAR-CONCEPTOS' 
               USING WS-CONCEPTOS-COBRO CONCEPTOS-COBRO-COUNT
           END-CALL.
           PERFORM 1000-MOSTRAR-CONCEPTOS.
           *> UNIR ARCHIVOS, ORDENAR Y GUARDAR
           CALL 'CONSOLIDAR-MOVIMIENTOS' END-CALL.
           *> PROCESAR, VALIDAR REGISTROS
           CALL 'PROCESAR-REGISTROS' 
               USING IN-FECHA-CONTABLE 
               WS-CONCEPTOS-COBRO CONCEPTOS-COBRO-COUNT
           END-CALL.
           PERFORM 100-EXIT.

       000-CONNECT.
           ACCEPT DATASRC FROM ENVIRONMENT 'DB1SRC'.
           ACCEPT DBUSR FROM ENVIRONMENT 'DB1USER'.
           ACCEPT DBPWD FROM ENVIRONMENT 'DB1PASS'.

           EXEC SQL
               CONNECT TO :DATASRC USER :DBUSR USING :DBPWD
           END-EXEC.

           DISPLAY 'CONECTADO A DB'. 

           IF SQLCODE <> 0 THEN
              GO TO 100-EXIT
           END-IF.
       
       1000-MOSTRAR-CONCEPTOS.
           PERFORM VARYING IDX-A FROM 1 BY 1 
                 UNTIL IDX-A > CONCEPTOS-COBRO-COUNT
                     DISPLAY 'CODIGO: ' CC-CODIGO-CONCEPTO(IDX-A) ' '
                         WITH NO ADVANCING
                     DISPLAY 'DESCRIPCION: ' CC-DESCRIPCION(IDX-A) ' '
                         WITH NO ADVANCING
                     DISPLAY 'TIPO: ' CC-TIPO-COBRO(IDX-A) ' '
                         WITH NO ADVANCING
                     DISPLAY 'ESTADO: ' CC-ESTADO(IDX-A)
           END-PERFORM.

       100-EXIT.
           EXEC SQL CONNECT RESET END-EXEC.
           STOP RUN.
