
       IDENTIFICATION DIVISION.

       PROGRAM-ID. CARGAR-CONCEPTOS.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

      * SOURCE-COMPUTER. IBM WITH DEBUGGING MODE.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

       DATA DIVISION.

       FILE SECTION.

       WORKING-STORAGE SECTION.

           EXEC SQL INCLUDE SQLCA END-EXEC.

       01 TB-CONCEPTOS-COBRO.
          10 HV-CODIGO-CONCEPTO PIC X(4).
          10 HV-DESCRIPCION      PIC X(30).
          10 HV-TIPO-COBRO       PIC X(1).
          10 HV-ESTADO           PIC X(1).

           EXEC SQL
              DECLARE CUR_CONCEPTOS 
              CURSOR FOR
               SELECT 
                   CODIGO_CONCEPTO,
                   DESCRIPCION,
                   TIPO_COBRO,
                   ESTADO
               FROM CONCEPTOS_COBRO
               ORDER BY CODIGO_CONCEPTO
           END-EXEC.

       LINKAGE SECTION.
       01 IN-FECHA-CONTABLE PIC 9(8).
           EXEC SQL INCLUDE CPY-CB-CCO END-EXEC.

       PROCEDURE DIVISION USING
           IN-FECHA-CONTABLE
           WS-CONCEPTOS-COBRO
           CONCEPTOS-COBRO-COUNT.

       100-MAIN.

           EXEC SQL START TRANSACTION END-EXEC.

           EXEC SQL OPEN CUR_CONCEPTOS END-EXEC.

           PERFORM VARYING IDX-A FROM 1 BY 1 UNTIL SQLCODE NOT = 0
               EXEC SQL
                   FETCH CUR_CONCEPTOS
                   INTO :HV-CODIGO-CONCEPTO,
                        :HV-DESCRIPCION,
                        :HV-TIPO-COBRO,
                        :HV-ESTADO
               END-EXEC

               IF SQLCODE = 0
                   MOVE HV-CODIGO-CONCEPTO TO CC-CODIGO-CONCEPTO(IDX-A)
                   MOVE HV-DESCRIPCION     TO CC-DESCRIPCION(IDX-A)
                   MOVE HV-TIPO-COBRO      TO CC-TIPO-COBRO(IDX-A)
                   MOVE HV-ESTADO          TO CC-ESTADO(IDX-A)
                   ADD 1 TO CONCEPTOS-COBRO-COUNT
               END-IF

           END-PERFORM.

           IF SQLCODE = 0
               EXEC SQL CLOSE CUR_CONCEPTOS END-EXEC
           END-IF.
           EXEC SQL COMMIT END-EXEC.

           DISPLAY 'FECHA: ' IN-FECHA-CONTABLE.
           DISPLAY 'CONCEPTOS CARGADOS: 'CONCEPTOS-COBRO-COUNT.
           PERFORM 1000-MOSTRAR-CONCEPTOS.
           GOBACK.

       1000-MOSTRAR-CONCEPTOS.
           PERFORM VARYING IDX-A FROM 1 BY 1 
               UNTIL IDX-A > CONCEPTOS-COBRO-COUNT
                   DISPLAY 'CODIGO: ' CC-CODIGO-CONCEPTO(IDX-A) ' '
                       WITH NO ADVANCING
                   DISPLAY 'DESCRIPCION: ' CC-DESCRIPCION(IDX-A) ' '
                       WITH NO ADVANCING
                   DISPLAY 'TIPO: ' CC-TIPO-COBRO(IDX-A) ' '
                       WITH NO ADVANCING
                   DISPLAY 'ESTADO: ' CC-ESTADO(IDX-A)
           END-PERFORM.
