
       IDENTIFICATION DIVISION.

       PROGRAM-ID. CARGAR-CONCEPTOS.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

      * SOURCE-COMPUTER. IBM WITH DEBUGGING MODE.

       INPUT-OUTPUT SECTION.

       FILE-CONTROL.

       DATA DIVISION.

       FILE SECTION.

       WORKING-STORAGE SECTION.

           EXEC SQL INCLUDE SQLCA END-EXEC.

           EXEC SQL INCLUDE CPY-CB-TB-CCO END-EXEC.

           EXEC SQL
              DECLARE CUR_CONCEPTOS 
              CURSOR FOR
               SELECT 
                   CODIGO_CONCEPTO,
                   DESCRIPCION,
                   TIPO_COBRO,
                   ESTADO
               FROM CONCEPTOS_COBRO
               ORDER BY CODIGO_CONCEPTO
           END-EXEC.

       LINKAGE SECTION.
           EXEC SQL INCLUDE CPY-CB-CCO END-EXEC.

       PROCEDURE DIVISION USING
           WS-CONCEPTOS-COBRO
           CONCEPTOS-COBRO-COUNT.

       100-MAIN.
           EXEC SQL START TRANSACTION END-EXEC. *> INICIO TRANSACCION
           EXEC SQL OPEN CUR_CONCEPTOS END-EXEC.

           PERFORM VARYING IDX-A FROM 1 BY 1 UNTIL SQLCODE NOT = 0
               EXEC SQL
                   FETCH CUR_CONCEPTOS
                   INTO :HV-CC-CODIGO-CONCEPTO,
                        :HV-CC-DESCRIPCION,
                        :HV-CC-TIPO-COBRO,
                        :HV-CC-ESTADO
               END-EXEC

               IF SQLCODE = 0
                   MOVE HV-CC-CODIGO-CONCEPTO TO CC-CODIGO-CONCEPTO(IDX-A)
                   MOVE HV-CC-DESCRIPCION     TO CC-DESCRIPCION(IDX-A)
                   MOVE HV-CC-TIPO-COBRO      TO CC-TIPO-COBRO(IDX-A)
                   MOVE HV-CC-ESTADO          TO CC-ESTADO(IDX-A)
                   ADD 1 TO CONCEPTOS-COBRO-COUNT
               END-IF

           END-PERFORM.

           IF SQLCODE = 0
               EXEC SQL CLOSE CUR_CONCEPTOS END-EXEC
           END-IF.
           EXEC SQL COMMIT END-EXEC. *> FIN TRANSACCION
           
           DISPLAY 'CONCEPTOS CARGADOS: 'CONCEPTOS-COBRO-COUNT.
           GOBACK.
