
       IDENTIFICATION DIVISION.

       PROGRAM-ID. CONSOLIDAR-MOVIMIENTOS.

       ENVIRONMENT DIVISION.

       CONFIGURATION SECTION.

      * SOURCE-COMPUTER. IBM WITH DEBUGGING MODE.

       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           *> YA ORDENADO POR COD-EST, COD-CON, COD-CAR LOS .DAT
           SELECT CAAC-FILE ASSIGN TO './data/CARGOS_ACADEMICOS.DAT'
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS CAAC-STATUS.

           SELECT CASE-FILE ASSIGN TO './data/CARGOS_SERVICIOS.DAT'
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS CASE-STATUS.

           SELECT MOVCO-FILE
               ASSIGN TO './gen/MOVIMIENTOS-CONSOLIDADOS.DAT'
           ORGANIZATION IS LINE SEQUENTIAL
           FILE STATUS MOVCO-STATUS.

           SELECT FILE-MERGE ASSIGN TO './gen/MERGE.TMP'.

       DATA DIVISION.
       FILE SECTION.
           FD CAAC-FILE.
               COPY CPY-CB-MOV-CA.
           FD CASE-FILE.
               COPY CPY-CB-MOV-CS.

           FD MOVCO-FILE.
               COPY CPY-CB-MOV-MC. *>MOVIMIENTOS CONSOLIDADOS

           SD FILE-MERGE.
           01 REG-MERGE.
               05 MG-ID-MOVIMIENTO      PIC 9(10).
               05 MG-FECHA-CARGO        PIC 9(8).
               05 MG-CODIGO-ESTUDIANTE  PIC 9(10).
               05 MG-CODIGO-CONCEPTO    PIC X(4).
               05 MG-VALOR              PIC 9(2).
    
       WORKING-STORAGE SECTION.
       01 CAAC-STATUS PIC XX.
       01 CASE-STATUS PIC XX.
       01 MOVCO-STATUS PIC XX.
           
       PROCEDURE DIVISION.
           
           MERGE FILE-MERGE
               ON ASCENDING KEY MG-CODIGO-ESTUDIANTE
               ON ASCENDING KEY MG-CODIGO-CONCEPTO
               ON ASCENDING KEY MG-FECHA-CARGO
               USING CAAC-FILE CASE-FILE
               GIVING MOVCO-FILE.
           IF MOVCO-STATUS = '00'
               DISPLAY 'MOVIMIENTO CONSOLIDADO EXITOSO!'
           ELSE
               DISPLAY 'ERROR! MOVCO-STATUS: ' MOVCO-STATUS
           END-IF.
           GOBACK.
