       01  MOV-REG.
           05 MOV-FECHA-MOV    PIC X(10).
           05 MOV-HORA-MOV     PIC X(08).
           05 MOV-COD-CLIENTE  PIC X(06).
           05 MOV-COD-MOTIVO   PIC X(02).
           05 MOV-VALOR        PIC S9(13)V99.
           05 MOV-OFICINA      PIC X(03).
