       01  TB-PARAMETROS.
           05 PAR-ITEM OCCURS 100 TIMES INDEXED BY IDX-PAR.
              10 PAR-COD-MOTIVO         PIC X(02).
              10 PAR-TIPO-ENTRADA       PIC X(15).
              10 PAR-CUENTA-CONTABLE    PIC X(12).
              10 PAR-NOMBRE-CUENTA      PIC X(30).
              10 PAR-OFICINA-AFECTACION PIC X(03).
       01  WS-COUNT-PARAM     PIC 9(03) VALUE ZEROES.
