***      CARGAR.CONCEPTOS

01 WS-TABLA-CONCEPTOS.
   05 WS-CONCEPTO OCCURS 50 TIMES.
      10 TBL-COD-CONCEPTO    PIC X(4).
      10 TBL-DESC-CONCEPTO   PIC X(30).
      10 TBL-CENTRO-COSTO    PIC 9(8).
      10 TBL-TIPO-COBRO      PIC X.
      10 TBL-ESTADO          PIC X.

01 WS-CANT-CONCEPTOS          PIC 9(2).

CALL 'CARGAR-CONCEPTOS'
    USING WS-TABLA-CONCEPTOS
          WS-CANT-CONCEPTOS
END-CALL.


LINKAGE SECTION.

01 LK-TABLA-CONCEPTOS.
   05 LK-CONCEPTO OCCURS 50 TIMES.
      10 LK-COD-CONCEPTO     PIC X(4).
      10 LK-DESC-CONCEPTO    PIC X(30).
      10 LK-CENTRO-COSTO     PIC 9(8).
      10 LK-TIPO-COBRO       PIC X.
      10 LK-ESTADO           PIC X.

01 LK-CANT-CONCEPTOS          PIC 9(2).

PROCEDURE DIVISION USING
    LK-TABLA-CONCEPTOS
    LK-CANT-CONCEPTOS.


*************************




cd EP-COBOL-002/jcl source ./TSQL001A-compile.sh && ./TSQL001A-run.sh