       IDENTIFICATION DIVISION.

       PROGRAM-ID. TSQL001A.


       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      * SOURCE-COMPUTER. IBM WITH DEBUGGING MODE.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       PROCEDURE DIVISION.

       100-MAIN.
           PERFORM 000-CONNECT.
           DISPLAY 'HELLO WORLD'
           PERFORM 100-EXIT.


       000-CONNECT.
           ACCEPT DATASRC FROM ENVIRONMENT 'DB1SRC'.
           ACCEPT DBUSR FROM ENVIRONMENT 'DB1USER'.
           ACCEPT DBPWD FROM ENVIRONMENT 'DB1PASS'.
           EXEC SQL
           CONNECT TO :DATASRC USER :DBUSR USING :DBPWD
           END-EXEC.
           IF SQLCODE <> 0
              DISPLAY 'ERROR DE CONEXION. SQLCODE=' SQLCODE
              GO TO 100-EXIT
           END-IF.

       100-EXIT.
           EXEC SQL CONNECT RESET END-EXEC.
           STOP RUN.