       01 CA-REG-MOVIMIENTO.
          05 CA-ID-MOVIMIENTO       PIC 9(10).
          05 CA-FECHA-CARGO         PIC 9(8).
          05 CA-CODIGO-ESTUDIANTE   PIC 9(10).
          05 CA-CODIGO-CONCEPTO     PIC X(4).
          05 CA-VALOR               PIC 9(2).
