       01 MO-REG-MOVIMIENTO-CONSOLIDADO.
          05 MO-ID-MOVIMIENTO       PIC 9(10).
          05 MO-FECHA-CARGO         PIC 9(8).
          05 MO-CODIGO-ESTUDIANTE   PIC 9(10).
          05 MO-CODIGO-CONCEPTO     PIC X(4).
          05 MO-VALOR               PIC 9(2).
