       01 CS-REG-MOVIMIENTO.
          05 CS-ID-MOVIMIENTO       PIC 9(10).
          05 CS-FECHA-CARGO         PIC 9(8).
          05 CS-CODIGO-ESTUDIANTE   PIC 9(10).
          05 CS-CODIGO-CONCEPTO     PIC X(4).
          05 CS-VALOR               PIC 9(2).
