       01 TB-CONCEPTOS-COBRO.
          10 HV-CC-CODIGO-CONCEPTO PIC X(4).
          10 HV-CC-DESCRIPCION      PIC X(30).
          10 HV-CC-TIPO-COBRO       PIC X(1).
          10 HV-CC-ESTADO           PIC X(1).
